{
    "generalPurposeComputers": {
        "title": "Computers as General-Purpose Machines",
        "familiar_with_computers_part1": "We are all familiar with widely popular <b>“general-purpose”</b> computers such as desktops, laptops, or tablets. Yet, modern mobile phones or gaming consoles are computers too, and even disparate devices such as digital cameras, audio players, watches, TV sets, washing machines, cars, drones, or even modern clothes and shoes, ",
        "familiar_with_computers_part2": " all embed computers that are instrumental to support their functionalities."
    },
    "examplesOfComputers": {
        "title": "Examples of Computers"
    },
    "genericArchitecture": {
        "title": "Computers' Common Generic Architecture",
        "architecture_intro": "Despite the huge varieties of computers, every single one of them shares a very similar architecture, and is made out of a physical part (<b>hardware</b>), as well as applications consisting of series of instructions (<b>software</b>).<br />The main objective of the architecture is to identify the main components and define <b>how</b> they interact with each other.<br />At the macroscopic level, this generic architecture can be schematized as in the following diagrams.",
        "cpu_description_part1": "The core component of any computer is the so-called Central Processing Unit (CPU). The CPU reads and executes instructions fetched one by one from primary (or central, or main) memory, processing the data in input and producing data in output. The input data could come, for example, from a keyboard or from a sensor detecting the level of oxygen in the blood of a patient. The output data, for example, could display a picture on a monitor or control the amount of gasoline injected in the engine of a car.<br /><br />Two key reasons have made it possible to use the same architecture for such a wide variety of contexts: the concept of ",
        "cpu_description_part2": " and the ",
        "cpu_description_part3": " of the information.",
        "stored_program_machines_button": "stored program machines",
        "digital_representation_button": "digital representation"
    },  
    "storedProgramMachines": {
        "title": "Stored Program Machines",
        "description": "Indeed, before the advent of the modern computer, machines able to carry out computations were already available. Yet <b>each machine was custom-built for a single, specific purpose</b>. A stored program computer, on the contrary, <b>is a machine that stores program instructions in memory</b>. By changing the programs in its memory, the same machine can perform totally different functions.<br />Modern memories are electronic, magnetic, or optical devices; in the past, program instructions were stored in plugboards or similar mechanisms.",
        "eniac_description": "The ENIAC was the first computing system, designed in the early 1940s, based on a primitive concept of a Stored Program Computer. Here the instructions, or programs, were stored as a combination of paper cards, plug-board wirings, and mechanical switches.",
        "modern_computer_description": "An example of a modern stored-program machine is the personal computer. In these devices, it is possible to easily install/uninstall and execute different applications, in order to support the most disparate functions.",
        "special_purpose_computer_description": "“Special-purpose computers” are computers that have fixed, preinstalled programs, hence predefined supported functions (e.g., medical appliances, calculators, traffic lights...). Yet, they have the same standard architecture as the other type of computers."
    },    
    "digitalRepresentation": {
        "title": "Digital (Uniform) Representation of Information",
        "description": "The second reason that made it possible to use the same architecture in many different contexts and applications is the possibility to <b>represent and process different types of information</b>, not only numbers, but also text, audio, images, videos…, uniformly as digits, as discussed in the next session."
    }    
}