{
    "instructionSetSection": {
      "title": "The CPU Instruction Set",
      "description": "The instruction set of a given CPU, also called Instruction Set Architecture (ISA), is the collection of instructions which that specific CPU can recognize and execute. Each instruction is a command to instruct the CPU to perform a certain elementary operation. It can be specified as Machine code (Binary/Hex) or Assembly code (Mnemonic equivalent of binary instructions).\n\nHere are some examples from the simulator:"
    },
    "instructionSection": {
        "text1": "The <b class=\"text-blue-700\">digits or text in blue</b> represent the <strong>Operation Code (opcode)</strong>: a binary number which represents the operation to perform. A binary number is naturally interpreted by a CPU, yet it is difficult to remember for a human. Hence, programmers can use its <strong>mnemonic (assembly)</strong> equivalent code to identify the desired operation, such as 'LOD', 'ADD', and 'STO'.",
        "text2": "The <b class=\"text-red-600\">digits or text in red</b> represent the operand(s) of the instruction. The operand has different interpretations according to the so-called addressing mode (which is also specified in the opcode). In the case of the simulator, the available addressing modes are:",
        "text3": "The instructions supported by a CPU can be organized into a few fundamental categories. The most important ones are:",
        "addressingModes": {
            "immediate": "<strong>Immediate</strong> (or <strong>numeric</strong>) addressing, as in ADD #8: in this case, the operand is a number (add the number 8)",
            "direct": "<strong>Direct</strong> addressing, as in ADD 8: in this case, the operand represents a memory address (add the number stored at the memory address 8). Rather than using directly numeric memory addresses, it is more convenient for humans to associate them with meaningful labels, such as Y or COUNTER. Hence a memory address can be more easily identified by a label, as in ADD Y. Important notice: the labels do not physically exist in the CPU or in memory because they are translated to the corresponding numerical addresses by the assembler, which can parse the whole assembly program offline. Yet, as the simulator translates the instructions one by one 'on the fly,' it is necessary first to <strong>define the labels</strong> by entering them in the grayed column, <strong>before</strong> they can be used in any instruction."
        },
        "description": "Try it yourself: run the simulator and write some instructions. You can swap from Mnemonic (Assembly) to Binary code just by clicking the Symbolic/Binary button.",
        "operationsSection": {
            "dataFlow": {
              "title": "<strong>Data flow operations</strong>: instructions used to transfer (store) the contents of a CPU register, or the result of a computation to the primary memory, or to transfer (load) data stored in the primary memory to the CPU, in order to perform a computation on it later.",
              "buttonText": "[1]"
            },
            "controlFlow": {
              "title": "<strong>Control flow operations</strong>: instructions that modify the order in which individual instructions are executed (instructions are otherwise executed in sequential order, one after the other), in order to perform a computation on it later.",
              "buttonText": "[2]"
            },
            "arithmeticLogic": {
              "title": "<strong>Arithmetic-logic operations</strong>: instructions that perform arithmetic (addition, subtraction...) and logic operations (and, not...), in order to perform a computation on it later.",
              "buttonText": "[3]"
            }
        }
    },
    "tableSection": {
        "text": "The following table reports the full set of instructions supported by the simulator, organized according to the above mentioned categories. For each instruction are reported: the opcode binary code in machine language, its assembly (mnemonic) equivalent, and a short informal description."
    }
  }
  